{"class_name": "Functional", "config": {"name": "inception_resnet_v1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 160, 160, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "Conv2d_1a_3x3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2d_1a_3x3", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "Conv2d_1a_3x3_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Conv2d_1a_3x3_BatchNorm", "inbound_nodes": [[["Conv2d_1a_3x3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Conv2d_1a_3x3_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Conv2d_1a_3x3_Activation", "inbound_nodes": [[["Conv2d_1a_3x3_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2d_2a_3x3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2d_2a_3x3", "inbound_nodes": [[["Conv2d_1a_3x3_Activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "Conv2d_2a_3x3_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Conv2d_2a_3x3_BatchNorm", "inbound_nodes": [[["Conv2d_2a_3x3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Conv2d_2a_3x3_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Conv2d_2a_3x3_Activation", "inbound_nodes": [[["Conv2d_2a_3x3_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2d_2b_3x3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2d_2b_3x3", "inbound_nodes": [[["Conv2d_2a_3x3_Activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "Conv2d_2b_3x3_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Conv2d_2b_3x3_BatchNorm", "inbound_nodes": [[["Conv2d_2b_3x3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Conv2d_2b_3x3_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Conv2d_2b_3x3_Activation", "inbound_nodes": [[["Conv2d_2b_3x3_BatchNorm", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "MaxPool_3a_3x3", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "MaxPool_3a_3x3", "inbound_nodes": [[["Conv2d_2b_3x3_Activation", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2d_3b_1x1", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2d_3b_1x1", "inbound_nodes": [[["MaxPool_3a_3x3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "Conv2d_3b_1x1_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Conv2d_3b_1x1_BatchNorm", "inbound_nodes": [[["Conv2d_3b_1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Conv2d_3b_1x1_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Conv2d_3b_1x1_Activation", "inbound_nodes": [[["Conv2d_3b_1x1_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2d_4a_3x3", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2d_4a_3x3", "inbound_nodes": [[["Conv2d_3b_1x1_Activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "Conv2d_4a_3x3_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Conv2d_4a_3x3_BatchNorm", "inbound_nodes": [[["Conv2d_4a_3x3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Conv2d_4a_3x3_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Conv2d_4a_3x3_Activation", "inbound_nodes": [[["Conv2d_4a_3x3_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2d_4b_3x3", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2d_4b_3x3", "inbound_nodes": [[["Conv2d_4a_3x3_Activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "Conv2d_4b_3x3_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Conv2d_4b_3x3_BatchNorm", "inbound_nodes": [[["Conv2d_4b_3x3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Conv2d_4b_3x3_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Conv2d_4b_3x3_Activation", "inbound_nodes": [[["Conv2d_4b_3x3_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block35_1_Branch_2_Conv2d_0a_1x1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block35_1_Branch_2_Conv2d_0a_1x1", "inbound_nodes": [[["Conv2d_4b_3x3_Activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "Block35_1_Branch_2_Conv2d_0a_1x1_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Block35_1_Branch_2_Conv2d_0a_1x1_BatchNorm", "inbound_nodes": [[["Block35_1_Branch_2_Conv2d_0a_1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Block35_1_Branch_2_Conv2d_0a_1x1_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Block35_1_Branch_2_Conv2d_0a_1x1_Activation", "inbound_nodes": [[["Block35_1_Branch_2_Conv2d_0a_1x1_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block35_1_Branch_1_Conv2d_0a_1x1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block35_1_Branch_1_Conv2d_0a_1x1", "inbound_nodes": [[["Conv2d_4b_3x3_Activation", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block35_1_Branch_2_Conv2d_0b_3x3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block35_1_Branch_2_Conv2d_0b_3x3", "inbound_nodes": [[["Block35_1_Branch_2_Conv2d_0a_1x1_Activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "Block35_1_Branch_1_Conv2d_0a_1x1_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Block35_1_Branch_1_Conv2d_0a_1x1_BatchNorm", "inbound_nodes": [[["Block35_1_Branch_1_Conv2d_0a_1x1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "Block35_1_Branch_2_Conv2d_0b_3x3_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Block35_1_Branch_2_Conv2d_0b_3x3_BatchNorm", "inbound_nodes": [[["Block35_1_Branch_2_Conv2d_0b_3x3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Block35_1_Branch_1_Conv2d_0a_1x1_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Block35_1_Branch_1_Conv2d_0a_1x1_Activation", "inbound_nodes": [[["Block35_1_Branch_1_Conv2d_0a_1x1_BatchNorm", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Block35_1_Branch_2_Conv2d_0b_3x3_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Block35_1_Branch_2_Conv2d_0b_3x3_Activation", "inbound_nodes": [[["Block35_1_Branch_2_Conv2d_0b_3x3_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block35_1_Branch_0_Conv2d_1x1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block35_1_Branch_0_Conv2d_1x1", "inbound_nodes": [[["Conv2d_4b_3x3_Activation", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block35_1_Branch_1_Conv2d_0b_3x3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block35_1_Branch_1_Conv2d_0b_3x3", "inbound_nodes": [[["Block35_1_Branch_1_Conv2d_0a_1x1_Activation", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block35_1_Branch_2_Conv2d_0c_3x3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block35_1_Branch_2_Conv2d_0c_3x3", "inbound_nodes": [[["Block35_1_Branch_2_Conv2d_0b_3x3_Activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "Block35_1_Branch_0_Conv2d_1x1_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Block35_1_Branch_0_Conv2d_1x1_BatchNorm", "inbound_nodes": [[["Block35_1_Branch_0_Conv2d_1x1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "Block35_1_Branch_1_Conv2d_0b_3x3_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Block35_1_Branch_1_Conv2d_0b_3x3_BatchNorm", "inbound_nodes": [[["Block35_1_Branch_1_Conv2d_0b_3x3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "Block35_1_Branch_2_Conv2d_0c_3x3_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Block35_1_Branch_2_Conv2d_0c_3x3_BatchNorm", "inbound_nodes": [[["Block35_1_Branch_2_Conv2d_0c_3x3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Block35_1_Branch_0_Conv2d_1x1_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Block35_1_Branch_0_Conv2d_1x1_Activation", "inbound_nodes": [[["Block35_1_Branch_0_Conv2d_1x1_BatchNorm", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Block35_1_Branch_1_Conv2d_0b_3x3_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Block35_1_Branch_1_Conv2d_0b_3x3_Activation", "inbound_nodes": [[["Block35_1_Branch_1_Conv2d_0b_3x3_BatchNorm", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Block35_1_Branch_2_Conv2d_0c_3x3_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Block35_1_Branch_2_Conv2d_0c_3x3_Activation", "inbound_nodes": [[["Block35_1_Branch_2_Conv2d_0c_3x3_BatchNorm", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "Block35_1_Concatenate", "trainable": true, "dtype": "float32", "axis": 3}, "name": "Block35_1_Concatenate", "inbound_nodes": [[["Block35_1_Branch_0_Conv2d_1x1_Activation", 0, 0, {}], ["Block35_1_Branch_1_Conv2d_0b_3x3_Activation", 0, 0, {}], ["Block35_1_Branch_2_Conv2d_0c_3x3_Activation", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block35_1_Conv2d_1x1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block35_1_Conv2d_1x1", "inbound_nodes": [[["Block35_1_Concatenate", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "Block35_1_ScaleSum", "trainable": true, "dtype": "float32", "function": ["4wIAAAAAAAAAAgAAAAMAAABTAAAAcxQAAAB8AGQBGQB8AGQCGQB8ARQAFwBTACkDTukAAAAA6QEA\nAACpACkC2gZpbnB1dHPaBXNjYWxlcgMAAAByAwAAAPobLi4vY29kZS9mYWNlbmV0X2tlcmFzX3Yx\nLnB52gg8bGFtYmRhPloAAADzAAAAAA==\n", null, null], "function_type": "lambda", "module": "tensorflow.python.keras.layers.core", "output_shape": [17, 17, 256], "output_shape_type": "raw", "output_shape_module": null, "arguments": {"scale": 0.17}}, "name": "Block35_1_ScaleSum", "inbound_nodes": [[["Conv2d_4b_3x3_Activation", 0, 0, {}], ["Block35_1_Conv2d_1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Block35_1_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Block35_1_Activation", "inbound_nodes": [[["Block35_1_ScaleSum", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block35_2_Branch_2_Conv2d_0a_1x1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block35_2_Branch_2_Conv2d_0a_1x1", "inbound_nodes": [[["Block35_1_Activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "Block35_2_Branch_2_Conv2d_0a_1x1_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Block35_2_Branch_2_Conv2d_0a_1x1_BatchNorm", "inbound_nodes": [[["Block35_2_Branch_2_Conv2d_0a_1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Block35_2_Branch_2_Conv2d_0a_1x1_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Block35_2_Branch_2_Conv2d_0a_1x1_Activation", "inbound_nodes": [[["Block35_2_Branch_2_Conv2d_0a_1x1_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block35_2_Branch_1_Conv2d_0a_1x1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block35_2_Branch_1_Conv2d_0a_1x1", "inbound_nodes": [[["Block35_1_Activation", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block35_2_Branch_2_Conv2d_0b_3x3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block35_2_Branch_2_Conv2d_0b_3x3", "inbound_nodes": [[["Block35_2_Branch_2_Conv2d_0a_1x1_Activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "Block35_2_Branch_1_Conv2d_0a_1x1_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Block35_2_Branch_1_Conv2d_0a_1x1_BatchNorm", "inbound_nodes": [[["Block35_2_Branch_1_Conv2d_0a_1x1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "Block35_2_Branch_2_Conv2d_0b_3x3_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Block35_2_Branch_2_Conv2d_0b_3x3_BatchNorm", "inbound_nodes": [[["Block35_2_Branch_2_Conv2d_0b_3x3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Block35_2_Branch_1_Conv2d_0a_1x1_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Block35_2_Branch_1_Conv2d_0a_1x1_Activation", "inbound_nodes": [[["Block35_2_Branch_1_Conv2d_0a_1x1_BatchNorm", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Block35_2_Branch_2_Conv2d_0b_3x3_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Block35_2_Branch_2_Conv2d_0b_3x3_Activation", "inbound_nodes": [[["Block35_2_Branch_2_Conv2d_0b_3x3_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block35_2_Branch_0_Conv2d_1x1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block35_2_Branch_0_Conv2d_1x1", "inbound_nodes": [[["Block35_1_Activation", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block35_2_Branch_1_Conv2d_0b_3x3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block35_2_Branch_1_Conv2d_0b_3x3", "inbound_nodes": [[["Block35_2_Branch_1_Conv2d_0a_1x1_Activation", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block35_2_Branch_2_Conv2d_0c_3x3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block35_2_Branch_2_Conv2d_0c_3x3", "inbound_nodes": [[["Block35_2_Branch_2_Conv2d_0b_3x3_Activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "Block35_2_Branch_0_Conv2d_1x1_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Block35_2_Branch_0_Conv2d_1x1_BatchNorm", "inbound_nodes": [[["Block35_2_Branch_0_Conv2d_1x1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "Block35_2_Branch_1_Conv2d_0b_3x3_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Block35_2_Branch_1_Conv2d_0b_3x3_BatchNorm", "inbound_nodes": [[["Block35_2_Branch_1_Conv2d_0b_3x3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "Block35_2_Branch_2_Conv2d_0c_3x3_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Block35_2_Branch_2_Conv2d_0c_3x3_BatchNorm", "inbound_nodes": [[["Block35_2_Branch_2_Conv2d_0c_3x3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Block35_2_Branch_0_Conv2d_1x1_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Block35_2_Branch_0_Conv2d_1x1_Activation", "inbound_nodes": [[["Block35_2_Branch_0_Conv2d_1x1_BatchNorm", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Block35_2_Branch_1_Conv2d_0b_3x3_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Block35_2_Branch_1_Conv2d_0b_3x3_Activation", "inbound_nodes": [[["Block35_2_Branch_1_Conv2d_0b_3x3_BatchNorm", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Block35_2_Branch_2_Conv2d_0c_3x3_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Block35_2_Branch_2_Conv2d_0c_3x3_Activation", "inbound_nodes": [[["Block35_2_Branch_2_Conv2d_0c_3x3_BatchNorm", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "Block35_2_Concatenate", "trainable": true, "dtype": "float32", "axis": 3}, "name": "Block35_2_Concatenate", "inbound_nodes": [[["Block35_2_Branch_0_Conv2d_1x1_Activation", 0, 0, {}], ["Block35_2_Branch_1_Conv2d_0b_3x3_Activation", 0, 0, {}], ["Block35_2_Branch_2_Conv2d_0c_3x3_Activation", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block35_2_Conv2d_1x1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block35_2_Conv2d_1x1", "inbound_nodes": [[["Block35_2_Concatenate", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "Block35_2_ScaleSum", "trainable": true, "dtype": "float32", "function": ["4wIAAAAAAAAAAgAAAAMAAABTAAAAcxQAAAB8AGQBGQB8AGQCGQB8ARQAFwBTACkDTukAAAAA6QEA\nAACpACkC2gZpbnB1dHPaBXNjYWxlcgMAAAByAwAAAPobLi4vY29kZS9mYWNlbmV0X2tlcmFzX3Yx\nLnB52gg8bGFtYmRhPloAAADzAAAAAA==\n", null, null], "function_type": "lambda", "module": "tensorflow.python.keras.layers.core", "output_shape": [17, 17, 256], "output_shape_type": "raw", "output_shape_module": null, "arguments": {"scale": 0.17}}, "name": "Block35_2_ScaleSum", "inbound_nodes": [[["Block35_1_Activation", 0, 0, {}], ["Block35_2_Conv2d_1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Block35_2_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Block35_2_Activation", "inbound_nodes": [[["Block35_2_ScaleSum", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block35_3_Branch_2_Conv2d_0a_1x1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block35_3_Branch_2_Conv2d_0a_1x1", "inbound_nodes": [[["Block35_2_Activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "Block35_3_Branch_2_Conv2d_0a_1x1_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Block35_3_Branch_2_Conv2d_0a_1x1_BatchNorm", "inbound_nodes": [[["Block35_3_Branch_2_Conv2d_0a_1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Block35_3_Branch_2_Conv2d_0a_1x1_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Block35_3_Branch_2_Conv2d_0a_1x1_Activation", "inbound_nodes": [[["Block35_3_Branch_2_Conv2d_0a_1x1_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block35_3_Branch_1_Conv2d_0a_1x1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block35_3_Branch_1_Conv2d_0a_1x1", "inbound_nodes": [[["Block35_2_Activation", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block35_3_Branch_2_Conv2d_0b_3x3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block35_3_Branch_2_Conv2d_0b_3x3", "inbound_nodes": [[["Block35_3_Branch_2_Conv2d_0a_1x1_Activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "Block35_3_Branch_1_Conv2d_0a_1x1_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Block35_3_Branch_1_Conv2d_0a_1x1_BatchNorm", "inbound_nodes": [[["Block35_3_Branch_1_Conv2d_0a_1x1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "Block35_3_Branch_2_Conv2d_0b_3x3_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Block35_3_Branch_2_Conv2d_0b_3x3_BatchNorm", "inbound_nodes": [[["Block35_3_Branch_2_Conv2d_0b_3x3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Block35_3_Branch_1_Conv2d_0a_1x1_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Block35_3_Branch_1_Conv2d_0a_1x1_Activation", "inbound_nodes": [[["Block35_3_Branch_1_Conv2d_0a_1x1_BatchNorm", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Block35_3_Branch_2_Conv2d_0b_3x3_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Block35_3_Branch_2_Conv2d_0b_3x3_Activation", "inbound_nodes": [[["Block35_3_Branch_2_Conv2d_0b_3x3_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block35_3_Branch_0_Conv2d_1x1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block35_3_Branch_0_Conv2d_1x1", "inbound_nodes": [[["Block35_2_Activation", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block35_3_Branch_1_Conv2d_0b_3x3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block35_3_Branch_1_Conv2d_0b_3x3", "inbound_nodes": [[["Block35_3_Branch_1_Conv2d_0a_1x1_Activation", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block35_3_Branch_2_Conv2d_0c_3x3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block35_3_Branch_2_Conv2d_0c_3x3", "inbound_nodes": [[["Block35_3_Branch_2_Conv2d_0b_3x3_Activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "Block35_3_Branch_0_Conv2d_1x1_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Block35_3_Branch_0_Conv2d_1x1_BatchNorm", "inbound_nodes": [[["Block35_3_Branch_0_Conv2d_1x1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "Block35_3_Branch_1_Conv2d_0b_3x3_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Block35_3_Branch_1_Conv2d_0b_3x3_BatchNorm", "inbound_nodes": [[["Block35_3_Branch_1_Conv2d_0b_3x3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "Block35_3_Branch_2_Conv2d_0c_3x3_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Block35_3_Branch_2_Conv2d_0c_3x3_BatchNorm", "inbound_nodes": [[["Block35_3_Branch_2_Conv2d_0c_3x3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Block35_3_Branch_0_Conv2d_1x1_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Block35_3_Branch_0_Conv2d_1x1_Activation", "inbound_nodes": [[["Block35_3_Branch_0_Conv2d_1x1_BatchNorm", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Block35_3_Branch_1_Conv2d_0b_3x3_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Block35_3_Branch_1_Conv2d_0b_3x3_Activation", "inbound_nodes": [[["Block35_3_Branch_1_Conv2d_0b_3x3_BatchNorm", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Block35_3_Branch_2_Conv2d_0c_3x3_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Block35_3_Branch_2_Conv2d_0c_3x3_Activation", "inbound_nodes": [[["Block35_3_Branch_2_Conv2d_0c_3x3_BatchNorm", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "Block35_3_Concatenate", "trainable": true, "dtype": "float32", "axis": 3}, "name": "Block35_3_Concatenate", "inbound_nodes": [[["Block35_3_Branch_0_Conv2d_1x1_Activation", 0, 0, {}], ["Block35_3_Branch_1_Conv2d_0b_3x3_Activation", 0, 0, {}], ["Block35_3_Branch_2_Conv2d_0c_3x3_Activation", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block35_3_Conv2d_1x1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block35_3_Conv2d_1x1", "inbound_nodes": [[["Block35_3_Concatenate", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "Block35_3_ScaleSum", "trainable": true, "dtype": "float32", "function": ["4wIAAAAAAAAAAgAAAAMAAABTAAAAcxQAAAB8AGQBGQB8AGQCGQB8ARQAFwBTACkDTukAAAAA6QEA\nAACpACkC2gZpbnB1dHPaBXNjYWxlcgMAAAByAwAAAPobLi4vY29kZS9mYWNlbmV0X2tlcmFzX3Yx\nLnB52gg8bGFtYmRhPloAAADzAAAAAA==\n", null, null], "function_type": "lambda", "module": "tensorflow.python.keras.layers.core", "output_shape": [17, 17, 256], "output_shape_type": "raw", "output_shape_module": null, "arguments": {"scale": 0.17}}, "name": "Block35_3_ScaleSum", "inbound_nodes": [[["Block35_2_Activation", 0, 0, {}], ["Block35_3_Conv2d_1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Block35_3_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Block35_3_Activation", "inbound_nodes": [[["Block35_3_ScaleSum", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block35_4_Branch_2_Conv2d_0a_1x1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block35_4_Branch_2_Conv2d_0a_1x1", "inbound_nodes": [[["Block35_3_Activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "Block35_4_Branch_2_Conv2d_0a_1x1_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Block35_4_Branch_2_Conv2d_0a_1x1_BatchNorm", "inbound_nodes": [[["Block35_4_Branch_2_Conv2d_0a_1x1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Block35_4_Branch_2_Conv2d_0a_1x1_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Block35_4_Branch_2_Conv2d_0a_1x1_Activation", "inbound_nodes": [[["Block35_4_Branch_2_Conv2d_0a_1x1_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block35_4_Branch_1_Conv2d_0a_1x1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block35_4_Branch_1_Conv2d_0a_1x1", 